M2_sigma/system/probes
probes
{
    type probes;
    name probes;
    libs ("sampling");
    executionInterval   5;
    executionControl   timeStep;
    writeInterval   5;
    writeControl   timeStep;
    probeLocations
    (
    (0.001 0.0002225 0.006)
    (0.001 0.0002225 0.018)
    (0.001 0.0002225 0.03)
    (0.001 0.0002225 0.042)
    (0.001 0.0002225 0.054)
    (0.001 0.0002225 0.066)
    (0.001 0.0002225 0.078)
    (0.001 0.0002225 0.09)
    (0.001 0.0002225 0.102)
    (0.001 0.0002225 0.114)
    (0.001 0.0002225 0.126)
    (0.001 0.0002225 0.138)
    (0.001 0.0002225 0.15)
    (0.001 0.0002225 0.162)
    (0.001 0.0002225 0.174)
    (0.001 0.0002225 0.186)
    (0.001 0.0002225 0.198)
    (0.001 0.0002225 0.21)
    (0.001 0.0002225 0.222)
    (0.001 0.0002225 0.234)
    (0.001 0.0002225 0.246)
    (0.001 0.0002225 0.258)
    (0.001 0.0002225 0.27)
    (0.001 0.0002225 0.282)
    (0.001 0.0002225 0.294)
    (0.001 0.0002225 0.306)
    (0.001 0.0002225 0.318)
    (0.001 0.0002225 0.33)
    (0.001 0.0002225 0.342)
    (0.001 0.0002225 0.354)
    (0.001 0.0002225 0.366)
    (0.001 0.0002225 0.378)
    (0.001 0.0002225 0.39)
    (0.001 0.0002225 0.402)
    (0.001 0.0002225 0.414)
    (0.001 0.0002225 0.426)
    (0.001 0.0002225 0.438)
    (0.001 0.0002225 0.45)
    (0.001 0.0002225 0.462)
    (0.001 0.0002225 0.474)
    (0.001 0.0002225 0.486)
    (0.001 0.0002225 0.498)
    (0.001 0.0002225 0.51)
    (0.001 0.0002225 0.522)
    (0.001 0.0002225 0.534)
    (0.001 0.0002225 0.546)
    (0.001 0.0002225 0.558)
    (0.001 0.0002225 0.57)
    (0.001 0.0002225 0.582)
    (0.001 0.0002225 0.594)
    (0.001 0.0002225 0.606)
    (0.001 0.0002225 0.618)
    (0.001 0.0002225 0.63)
    (0.001 0.0002225 0.642)
    (0.001 0.0002225 0.654)
    (0.001 0.0002225 0.666)
    (0.001 0.0002225 0.678)
    (0.001 0.0002225 0.69)
    (0.001 0.0002225 0.702)
    (0.001 0.0002225 0.714)
    (0.001 0.0002225 0.726)
    (0.001 0.0002225 0.738)
    (0.001 0.0002225 0.75)
    (0.001 0.0002225 0.762)
    (0.001 0.0002225 0.774)
    (0.001 0.0002225 0.786)
    (0.001 0.0002225 0.798)
    (0.001 0.0002225 0.81)
    (0.001 0.0002225 0.822)
    (0.001 0.0002225 0.834)
    (0.001 0.0002225 0.846)
    (0.001 0.0002225 0.858)
    (0.001 0.0002225 0.87)
    (0.001 0.0002225 0.882)
    (0.001 0.0002225 0.894)
    (0.001 0.0002225 0.906)
    (0.001 0.0002225 0.918)
    (0.001 0.0002225 0.93)
    (0.001 0.0002225 0.942)
    (0.001 0.0002225 0.954)
    (0.001 0.0002225 0.966)
    (0.001 0.0002225 0.978)
    (0.001 0.0002225 0.99)
    (0.001 0.0002225 1.002)
    (0.001 0.0002225 1.014)
    (0.001 0.0002225 1.026)
    (0.001 0.0002225 1.038)
    (0.001 0.0002225 1.05)
    (0.001 0.0002225 1.062)
    (0.001 0.0002225 1.074)
    (0.001 0.0002225 1.086)
    (0.001 0.0002225 1.098)
    (0.001 0.0002225 1.11)
    (0.001 0.0002225 1.122)
    (0.001 0.0002225 1.134)
    (0.001 0.0002225 1.146)
    (0.001 0.0002225 1.158)
    (0.001 0.0002225 1.17)
    (0.001 0.0002225 1.182)
...
    );
    fields (U p);
}
